app/views/arts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <% @reviews.each do |review|%>
        <h5>Comment By <%=User.find(review.user_id).first_name %></h5>