app/views/arts/show.pdf.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% @reviews.each do |review|%>
         <h5>Comment By <%=User.find(review.user_id).first_name %></h5>