app/controllers/arts_controller.rb

  def index
      @arts = Art.order('created_at DESC')
---
SELECT "arts".* FROM "arts" ORDER BY created_at DESC

  def show
    @reviews = Review.where(art_id: @art.id).order("created_at DESC")

    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."art_id" = ? ORDER BY created_at DESC  [["art_id", 2]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."art_id" = ?  [["art_id", 2]]

  def create
    @art = current_user.arts.build(art_params)
    respond_to do |format|
      if @art.save
---
INSERT INTO "arts" ("title", "description", "rating", "price", "user_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "owner_by") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @art.update(art_params)
---
UPDATE "arts" SET "owner_by" = ?, "updated_at" = ? WHERE "arts"."id" = ?  [["owner_by", ""], ["updated_at", "2020-09-28 06:13:31.415003"], ["id", 2]]

    def set_art
      @art = Art.find(params[:id])
---
SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]