app/controllers/logins_controller.rb

  def create
  	user = User.find_or_create_by!(email: params[:user][:email])

  	    user.update!(login_token: SecureRandom.urlsafe_base64,
      login_token_valid_until: Time.now + 5.minutes)
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "abuthair8690@gmail.com"], ["created_at", "2020-09-26 08:15:07.136151"], ["updated_at", "2020-09-26 08:15:07.136151"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "abuthair8690@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "login_token" = ?, "login_token_valid_until" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["login_token", "iDdLWy3AyIZlFi-372NfTw"], ["login_token_valid_until", "2020-09-26 11:07:37.710589"], ["updated_at", "2020-09-26 10:07:37.713914"], ["id", 1]]