app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.art_id = @art.id


      if current_user.category == "Art Owner"
              if @review.save
                redirect_to @art
              else
               render 'new'
              end
        else

        @review = Review.where(user_id: current_user.id, art_id: params[:art_id]).first_or_initialize
        if @review.id.present?
---
INSERT INTO "reviews" ("rating", "comment", "user_id", "art_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 3], ["comment", "awesome"], ["user_id", 1], ["art_id", 1], ["created_at", "2020-09-27 04:41:23.365556"], ["updated_at", "2020-09-27 04:41:23.365556"]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."art_id" = ? ORDER BY "reviews"."id" ASC LIMIT ?  [["user_id", 1], ["art_id", 1], ["LIMIT", 1]]
SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", nil], ["updated_at", "2020-09-29 07:25:37.344394"], ["id", 1]]

    def set_art
      @art = Art.find(params[:art_id])
---
SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]