app/controllers/sessions_controller.rb

  def create
  	 user = User.where(login_token: params[:login_token]).where('login_token_valid_until > ?', Time.now).first

  	 if user
  	 	user.update!(login_token:nil,login_token_valid_until: 5.minutes)
---
SELECT  "users".* FROM "users" WHERE "users"."login_token" = ? AND (login_token_valid_until > '2020-09-26 11:38:49.856444') ORDER BY "users"."id" ASC LIMIT ?  [["login_token", "fHaBBQTLRbKe3WmwxFk-xg"], ["LIMIT", 1]]
UPDATE "users" SET "login_token" = ?, "login_token_valid_until" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["login_token", nil], ["login_token_valid_until", nil], ["updated_at", "2020-09-26 11:38:49.874813"], ["id", 2]]