app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = ?, "last_name" = ?, "category" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Syed "], ["last_name", "Abuthahir"], ["category", 0], ["updated_at", "2020-09-28 13:18:03.646809"], ["id", 1]]
---
  def update
  	current_user.update! user_params